In [1]:
import pandas as pd

In [2]:
data = {
      'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
      'Age': [24, 27, 22, 32, 29],
      'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR'],
      'Salary': [45000, 54000, 50000, 62000, 47000]
  }

In [7]:
df_1 = pd.DataFrame(data)
df_1

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

In [8]:
df_1.head()

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

In [13]:
summary = df_1[['Age','Salary']].describe()
summary

             Age        Salary
count   5.000000      5.000000
mean   26.800000  51600.000000
std     3.962323   6730.527468
min    22.000000  45000.000000
25%    24.000000  47000.000000
50%    27.000000  50000.000000
75%    29.000000  54000.000000
max    32.000000  62000.000000

In [23]:
average_salary = df[df['Department'] == 'HR']['Salary'].mean()
average_salary

46000.0

In [24]:
df_1['Bouns'] = df_1['Salary'] * 0.10

df_1

      Name  Age Department  Salary   Bouns
0    Alice   24         HR   45000  4500.0
1      Bob   27    Finance   54000  5400.0
2  Charlie   22         IT   50000  5000.0
3    Diana   32  Marketing   62000  6200.0
4      Eve   29         HR   47000  4700.0

In [26]:
age = df_1[df_1['Age'].between(25,30)]
age

  Name  Age Department  Salary   Bouns
1  Bob   27    Finance   54000  5400.0
4  Eve   29         HR   47000  4700.0

In [28]:
groupby_df = df_1.groupby('Department')['Salary'].mean()
groupby_df

Department
Finance      54000.0
HR           46000.0
IT           50000.0
Marketing    62000.0
Name: Salary, dtype: float64

In [29]:
sort_df = df_1.sort_values(by = 'Salary', ascending = True)
sort_df

      Name  Age Department  Salary   Bouns
0    Alice   24         HR   45000  4500.0
4      Eve   29         HR   47000  4700.0
2  Charlie   22         IT   50000  5000.0
1      Bob   27    Finance   54000  5400.0
3    Diana   32  Marketing   62000  6200.0

In [30]:
df.to_csv('Sorted_data.csv',index = False)